{
  "data": [
    {
      "title": "NewStrike",
      "description": "‘Newstrike’는 야구 뉴스레터와 실시간 챗봇 기능을 제공하는 프로그램입니다. LLM을 통해 생성된 야구 뉴스레터 서비스는 최신 야구 뉴스를 보기 편하게 전달합니다. 사용자는 메인 페이지에서 야구 뉴스레터 게시물을 볼 수 있고, 구독 시 이메일로 전송됩니다. 뉴스레터를 읽는 도중 모르는 용어나 내용이 존재하는 경우, LLM을 사용한 챗봇에게 야구 관련 질문을 하고 즉각적인 답변을 얻을 수 있습니다. 뉴스레터 게시물에는 좋아요와 스크랩 기능이 있으며, 출석체크 등급 제도를 통해 사용자의 Newstrrike의 이용률을 높일 수 있습니다. 야구 관련 질문과 함께 야구 뉴스레터를 즐겨보세요!",
      "intention": "뉴스를 읽으면서 이해되지 않거나 모르는 용어가 나와 답답함을 느낀 적이 있으신가요? 하나의 뉴스로 모든 정보를 얻고 싶은데, 정보가 여기저기 흩어져 있어 여러 기사를 읽어야 하는 불편함을 겪으신 적이 있으신가요? 우리 서비스 “Newstrike”는 이러한 사용자들의 뉴스 경험을 개선하기 위해 기획된 프로젝트입니다. 바쁜 일상 속에서 필요한 정보를 찾기 위해 많은 시간을 허비하는 경우가 많습니다. 이를 해결하기 위해, 우리는 다양한 뉴스 사이트를 방문할 필요 없이 중요한 정보를 요약한 야구 뉴스레터를 제공하여 사용자의 시간을 절약하고자 했습니다. 또한, 뉴스레터를 읽다가 모르는 것이 있으면 바로 물어볼 수 있는 챗봇을 제공하여 우리 웹사이트에서 모든 것을 해결할 수 있는 간편함을 제공합니다.",
      "tool" : ["Vscode", "IntelliJ", "React", "Git", "Figma", "Docker", "PostgreSQL", "ChromaDB", "Llama2", "Llama3", "PyTorch"],
      "language": ["Java", "Python", "JavaScript"]
    },
    {
      "title": "FACT CHECK",
      "description": "‘FACT CHECK’는 사용자들이 언론 분야의 뉴스를 접할 때, 정보의 신뢰도에 대한 정확한 판단을 하도록 개발하게 된 작품입니다.\n서울대학교 언론정보연구소에서 다수의 전문가들에게 검증된 뉴스 데이터들을 바탕으로 transformer 기반 모델을 사용하여 가짜뉴스 텍스트의 특징을 학습하고 이를 검증하도록 하였습니다. 검증을 모두 수행한 뒤에는 사용자의 입력 값을 퍼센트의 형태로 판단하여 결과값을 한눈에 알아보기 쉽도록 하였습니다. 또한 ‘상세 검증’ 서비스를 추가로 도입하여 정보 업데이트의 공백을 해소하고자 하였고, 이는 다양한 검증 자료와 검증 사이트를 추가로 제공하여 사용자들로 하여금 더욱 정확한 판단을 하도록 도와줍니다.",
      "intention": "우리가 살고 있는 지식정보화시대에는 매 순간 방대한 양의 정보가 생성되고 활용됩니다. 이러한 발전은 언론계에도 많은 변화를 가져와 사용자들은 매일 더 빠르게 더 넓은 세상의 소식을 받아볼 수 있게 되었습니다. 하지만 이 정보들을 모두 믿어도 되는 걸까요?\n저희는 이 작은 불신의 불씨로부터 작품의 구상을 시작하였습니다. 우리가 매일 접하는 뉴스와 교묘하게 심리를 자극하는 여러 형식의 정보들이 더 이상 믿을 만한 정보가 아니라는 것을 알고 있습니다. 하지만 언론의 자유가 보장된 사회에서 특정 정보의 옳고 그름을 판단하는 기준을 찾는 것은 어려운 일입니다. 특히 다양한 의견이 존재하는 정치 분야의 정보는 더욱더 날 것이거나 거짓으로 포장된 정보들이 많습니다.\n학부생의 입장에서 한정된 자원과 1년이라는 짧은 시간 동안 세상의 모든 정보의 진실을 검증할 수는 없었습니다. 하지만 저희는 이러한 작은 도전이 세상을 향해 던지는 첫 번째 변화구가 되길 바라며 ‘가짜뉴스 탐지 웹 서비스’를 기획하게 되었습니다.",
      "tool": ["Vscode", "MySQL", "React", "Flask", "Colab", "PyTorch", "Transformer_model"],
      "language": ["Python", "JavaScript"]
    },
    {
      "title": "혼합현실 RC카 게임",
      "description": "“혼합현실 RC카 게임”은 라즈베리파이를 이용하여 만든 실물 RC카가 가상의 오브젝트를 포함한 게임 공간을 주행하는 실감형 게임입니다.\n\nRC카는 단조로운 현실 공간을 주행합니다. 하지만 게임 화면으로 RC카 내장 카메라로 보는 현실 공간과 더불어 다양한 가상 오브젝트를 동시에 확인할 수 있습니다.",
      "intention": "현재의 기술 트렌드 중 확장현실(eXtended Reality)에 주목하였고, 몰입도 높은 프로덕트를 개발하고자 “혼합현실 RC카 게임”을 기획하였습니다.\n\n애플 비전 프로 출시와 같이 실감형 콘텐츠에 대한 관심이 커지는 현 시점에서 실감형 콘텐츠를 게임으로 풀어내고자 한 이유는 몰입도 측면에서 게임 분야가 실감형 콘텐츠를 가장 잘 활용할 수 있는 분야로 생각되었기 때문입니다.\n\n일반적인 RC카 주행은 현실 공간에서만 이루어지지만, 본 게임은 현실 공간에 가상의 오브젝트 및 효과를 투영하여 현실과 가상이 혼합된 색다른 게임 경험을 가능하도록 합니다.",
      "tool": ["Unity", "VScode", "Visual_Studio", "MongoDB", "AWS"],
      "language": ["Python", "HTML", "CSS", "JavaScript"],
      "hardware": ["RaspberryPi"]
    },
    {
      "title": "PrivStream",
      "description": "오늘날 스트리밍 방송이 일상적으로 친근하게 다가오면서, 우리는 다양한 개인정보 유출의 위협에 직면하고 있습니다.\n\n스트리밍 방송은 실시간으로 많은사람에게 공개되기 때문에, 방송 중에 개인의 얼굴이나 기타 개인정보가 노출될 수 있는 위험이 높습니다. 이러한 문제를 해결하기 위해, 저희는 방송 중에 노출될 수 있는 개인의 얼굴을 실시간으로 인식하고 개인정보 유출 객체를 탐지하여 자동으로 모자이크 처리하는 스트리밍 환경을 제공합니다. 이를 통해 사용자들에게 안전하고 안심할 수 있는 스트리밍 환경을 제공하고자 합니다.\n\n또한 동영상 후 편집 기능을 통해 추가적으로 아바타를 생성하여 처리해주는 기능을 제공합니다. 방송자는 복잡한 편집 과정을 거치지 않고도 개인정보 보호 기능을 손쉽게 활용할 수 있으며, 원하는 화풍의 아바타를 생성하여 씌워주는 기능을 제공합니다. 시청자와 방송에 우연히 나오는 일반인들 모두에게 개인정보 보호가 강화된 방송과 더불어 아바타를 통한 재미 또한 즐길 수 있습니다.",
      "intention": "개인의 초상권과 개인정보를 실시간으로 보호함으로써 예상치 못한 피해를 예방합니다. 개인의 얼굴이 무단으로 노출되는 것을 방지하여, 개인의 사생활 침해를 최소화할 수 있습니다.\n\n방송 중 나오는 얼굴을 인식하여 일반인의 얼굴과 개인정보를 자동으로 모자이크 처리함으로써, 공공장소나 다중이 모인 장소에서 촬영 시 발생할 수 있는 개인정보 유출 문제를 효과적으로 해결할 수 있습니다. 이를 통해 자유롭게 콘텐츠를 제작할 수 있습니다.\n\n수동적인 동영상 편집 과정 없이 모자이크를 자동으로 처리함으로써, 편집 노동력을 줄일 수 있습니다. 이는 시간과 비용 절감으로 이어집니다.또한, 동영상 후 편집 기능을 통해 추가적으로 아바타를 생성하여 영상에 적용할 수 있어, 편집 후에도 개인정보가 보호되고 시각적 즐거움이 더해집니다. 이를 통해 방송자와 시청자 모두에게 긍정적인 영향을 미칠 것으로 기대합니다.",
      "tool": ["VScode", "Git", "NGINX", "MySQL", "Django", "Flutter"],
      "language": ["Python", "Dart"]
    },
    {
      "title": "보안을 고려한 의료 마이데이터 활용 애플리케이션",
      "description": "‘Doc’tech’ 어플리케이션은 환자가 흩어져 있는 자신의 의료 데이터를 손쉽게 관리하고 활용할 수 있도록 도와주는 비대면 진료 서비스입니다. 기존의 서비스들이 제공하는 한정된 의료 마이데이터와 복잡한 사용자 경험성을 개선하여, 환자가 한눈에 자신의 건강 상태를 파악하고 효율적으로 관리할 수 있게 합니다. 또한, 의료 마이데이터와 결합된 진료 서비스를 통해 비대면 진료의 장점을 극대화하여 환자에게 최상의 의료 경험을 제공합니다.의료진은 ‘Doc’tech’ 어플리케이션을 통해 환자 개개인의 특성을 반영한 맞춤형 진료 서비스를 제공합니다. 환자의 과거 진료 기록, 검사 결과, 처방 내역 등 다양한 의료 정보를 안전하게 제공받아, 환자의 설명에 의존하지 않고도 정확한 진단과 치료 계획을 세울 수 있습니다.",
      "intention": "팬데믹 이후 비대면 진료를 쉽게 접할 수 있게 되었습니다. 하지만 실제로 비대면 진료를 받을 땐 이전 진료에 대한 의료 정보가 부재하여 정확한 진단을 받는 데에 어려움이 있습니다. 이를 해결하면서 매년 발생하는 의료진의 환자 명의도용 문제를 예방하기 위해 비식별화된 의료 마이데이터를 의료진에게 제공하여 정확하고 안전한 비대면 진료 서비스를 제공하는 애플리케이션을 기획하게 되었습니다. 이를 통해 사용자에게 최상의 비대면 진료 경험을 제공하는 것을 목표로 합니다.",
      "tool": ["React_Native", "Spring_Boot", "AWS_RDS", "Vscode", "Intellij", "Figma", "Docker", "Git", "GitHub"],
      "language": ["Java", "JavaScript"]
    },
    {
      "title": "투명한 열쇠",
      "description": "투명한 열쇠는 비가시적 워터마크 삽입을 쉽고 간편하게 할 수 있는 카메라 앱 서비스입니다.\n\n워터마크가 삽입된 사진이 밝기 변경, 화질 저하, 블러링 등의 공격을 받더라도 정상적으로 추출될 수 있도록 하는 것을 목표로 합니다.\n\n이미지의 DCT 변환을 활용하여 주파수 공간에서 알고리즘이 수행됩니다. 주파수 공간에서의 값 변화는 시각적으로 차이가 거의 없어 비가시성을 보장합니다. 또한 밝기 변화, JPEG 압축, 화질 저하 등의 공격에도 워터마크가 추출될 수 있도록 설계했습니다. 이에 따라 디지털 환경에 노출될 수 있는 다양한 공격에도 저작권을 보호할 수 있습니다.\n\n투명한 열쇠는 사용자가 사진의 진위를 쉽게 확인하고, 소유권을 효과적으로 증명할 수 있도록 도와줍니다. 사용자는 날짜와 시간/이름/닉네임 데이터를 QR코드로 변환하여 삽입할 수 있으며, 인증 시에는 불러온 사진에서 QR코드를 스캔하여 데이터를 읽을 수 있습니다.",
      "intention": "저작권이 있는 사진을 범죄에 악용하는 사건이 증가하고 있으며, 소유자의 수익 창출 문제도 발생하고 있음을 확인했습니다.이러한 사회적 이슈가 발생하는 원인이 미디어에 대한 저작권자가 누구인지 쉽게 확인할 수 있는 수단이 없기 때문이라고 판단하였습니다. 기존의 저작권 등록 방식은 절차가 매우 까다롭고 창작성이 없는 경우 등록이 되지 않는 등 인정받기 위한 조건 만족하기 힘듭니다.\n\n따라서 원작자 본인의 저작권을 빠르고 쉽게 보호할 수 있는 기능을 제공하는 비가시적 워터마킹 서비스를 개발하여 이 같은 사건의 발생 빈도 감소에 기여하고자 합니다.",
      "tool": ["Android_Studio", "Pycharm", "Figma", "SQLite", "AWS"],
      "language": ["Kotlin", "Python"]
    },
    {
      "title": "무생체(무형 생체 보안 시스템)",
      "description": "특정한 사람이 타자를 칠 때, 특정 개인의 이전 키스트로크 데이터와 새롭게 입력받은 키스트로크가 동일할 것이라는 가정을 바탕으로 제작된 프로그램입니다.\n\n채팅 사이트에서 채팅을 하는 가상 환경을 만들고, 주기적으로 사용자의 키스트로크 데이터를 수집하여 지속인증 CA(continuous authentication)을 진행합니다. Python으로 로그 수집 코드를 만들었고, 이를 이용하여 수집한 데이터를 KNN 모델링에 넣은 후 전처리, 이상치 제거 과정을 통해 정확도를 높였습니다.\n\n실제 타자를 쳐서 얻은 데이터에 라벨링을 하고 실제로 저장되어 있는 키스트로크의 라벨링과 현재 사용자로 지정한 라벨링이 일치하는지 프로그램을 통해 확인합니다. 불일치할 경우 경고창을 띄워 채팅 사이트를 사용하지 못하게 만들었으며 이를 통해 하이재킹을 막아 개인 정보 해킹을 줄일 수 있습니다.",
      "intention": "온라인 활동이 크게 활성화된 요즘, 정보 보안은 그 추세를 따라가지 못함이 현실입니다. 해킹 피해가 증가하고 보안에 대한 관심도가 높아지긴 했으나 OTP, IP주소 등록 등 각종 보안 시스템 또한 해킹을 당하기도 하며, 이러한 보안 시스템은 번거롭다는 단점이 있습니다. 온라인 채팅 사이트도 타인이 무단으로 도용하는 등 보안이 무력화되는 경우가 많이 발생하고 있습니다. 저희 팀은 이것에 착안하여, 자주 사용하는 사이트 등에 접속하여 사이트를 이용할 때 개인의 생체 정보인 ‘키스트로크’를 사용하여 타자를 치면 본인인지 아닌지 검증해주는 프로그램을 제작하였습니다.\n\n이를 통해 자주 이용하는 사이트에 접속 시 2차적으로 보안을 진행하는 번거로움을 최소로 줄여 편의성을 높일 수 있습니다. 동시에 누군가가 해킹하기 어려운 생체 정보를 이용하여 보안성까지 높일 수 있습니다.",
      "tool": ["Vscode", "Jupyter_notebook", "Anaconda", "Node.js", "Flask"],
      "language": ["Python", "JavaScript", "CSS"]
    },
    {
      "title": "음성의 감시탑",
      "description": "보이스피싱을 예방할 수 있는 방법에는 무엇이 있을까요?\n본 프로젝트는 이 질문에 대한 답으로 “음성의 감시탑”을 제안합니다. 이 작품은 사용자의 휴대폰에 저장된 비디오 파일로부터 음성을 추출하고, 이를 기반으로 화자를 식별하여 보이스피싱을 방지하는 시스템을 포함합니다.\n“음성의 감시탑”은 사용자가 사전에 등록한 가족이나 지인의 목소리를 학습하여, 전화가 걸려올 때 자동으로 화자를 분석합니다. 시스템은 사용자의 전화 통화와 음성 메시지를 실시간으로 모니터링하며, 의심스러운 전화가 감지되면 경고를 발송합니다. 이 과정에서 시스템은 화자의 음성을 분석하고, 저장된 음성 데이터와 비교하여 신뢰할 수 있는 사람인지 여부를 판단합니다. 이러한 방식으로 “음성의 감시탑”은 보이스피싱 공격자로부터 오는 위협을 조기에 감지하고, 사용자가 의심스러운 전화에 대한 경각심을 가질 수 있도록 돕습니다. 결과적으로, 사용자들은 보이스피싱 피해를 효과적으로 예방할 수 있으며, 보다 안전하고 신뢰할 수 있는 통신 환경을 구축할 수 있습니다.\n이 작품은 특히 보이스피싱의 피해를 방지하는 데 중점을 두고 설계되었으며, 기술적인 신뢰성뿐만 아니라 사용자 친화적인 인터페이스를 제공하여 모든 연령층의 사용자가 쉽게 접근하고 활용할 수 있도록 하고 있습니다. 이를 통해 보이스피싱의 위협에서 벗어나 보다 안전한 일상 통신을 가능하게 하는 것이 본 프로젝트의 궁극적인 목표입니다.",
      "intention": "해당 프로젝트의 기획 의도는 급증하는 보이스피싱 범죄로부터 사용자들을 효과적으로 보호하기 위함입니다. 보이스피싱은 전화나 음성 메시지를 통해 개인 정보를 탈취하고 금전적 피해를 유발하는 범죄로 그 수법이 점점 더 정교해지고 있습니다. 특히, 최근에는 유아를 납치하여 부모에게 전화로 금전을 요구하는 등의 극단적인 사례도 발생하고 있습니다. 이러한 범죄는 가족들에게 큰 심리적 충격과 금전적 손실을 초래하기 때문에, 이를 예방할 수 있는 기술적 방안이 절실히 필요합니다.\n본 프로젝트는 음성 인식 기술을 활용하여 사용자의 가족 혹은 지인의 목소리를 학습하고, 전화가 걸려올 때 화자를 분석하여 신뢰성을 평가하는 시스템을 개발하는 것을 목표로 합니다. 이 시스템은 사용자가 수신하는 전화의 화자가 등록된 신뢰할 수 있는 사람인지 여부를 실시간으로 판단하고, 의심스러운 전화가 감지될 경우 경고를 제공함으로써 보이스피싱 피해를 사전에 방지합니다. 또한, 본 작품은 사용자 친화적인 인터페이스를 제공하여 누구나 쉽게 사용할 수 있도록 설계되었습니다. 이를 통해 모든 연령층의 사용자들이 보이스피싱 위협으로부터 안전하게 보호받을 수 있으며, 나아가 전반적인 통신 환경의 신뢰성을 향상시키고 사용자들의 심리적 안정을 도모하는 데 기여하고자 합니다.",
      "tool": ["PyCharm", "Android_Studio", "Figma", "Flask"],
      "language": ["Python", "Flutter"]
    },
    {
      "title": "Walk With Me",
      "description": "간단히 산책을 하고 싶은데 울퉁불퉁한 지형, 오르막길 때문에 무릎 통증, 약한 관절 등이 걱정되신 적이 있으신가요?\n“Walk With Me”는 개인 맞춤 서비스로, 사용자에게 맞는 산책 서비스를 제공합니다. 사용자의 건강 정보를 수집하여 개인 맞춤형 산책 경로를 제공하고, 커뮤니티를 이용하여 다른 사용자와 실시간 소통 및 정보를 공유할 수 있습니다. 일일 미션 수행 및 커뮤니티 활동을 통해 리워드를 부여하여 성취감을 얻을 수 있습니다. 획득한 리워드로는 ‘Shop’ 페이지에서 원하는 상품, 기프티콘 등을 구매할 수 있습니다.",
      "intention": "최근 스마트폰과 컴퓨터 사용시간의 증가로 자연스럽게 신체 활동이 감소되고 있습니다. 이로 인해 척추측만증, 거북목증후군 등의 비정상적인 체형 변화가 늘어나고 있습니다. 신체 활동은 우리의 정신 건강에도 중요한 영향을 미치며 삶의 질을 향상시켜 주는 등 건강한 삶을 유지하는 데 꼭 필요한 활동입니다. 이 작품은 즐겁고 일상적인 운동을 통한 스트레스 해소로 국민 건강 증진에 힘을 쓰고 싶어 제작되었습니다. 따라서 건강 문제로 고민이 많은 현대인들, 격한 운동보다는 가벼운 산책으로 재밌게 운동을 하고 싶은 사람들에게 삶에서 소소한 행복을 찾을 수 있도록 하였습니다.",
      "tool": ["VScode", "MySQL", "Flask"],
      "language": ["JAVA", "Python", "JavaScript", "HTML", "CSS"]
    },
    {
      "title": "Klaxon",
      "description": "경적을 의미하는 클락션은 주변 상황을 인지하고 대처하는 데 도움을 주는 역할을 합니다. 이처럼, 우리 서비스는 AI의 오인식 및 오분류에 대한 정보를 사용자에게 빠르게 제공하여 기업이 이를 신속히 인지하고 AI의 취약점을 해결할 수 있도록 돕습니다.\n\n자율주행 시나리오를 구현하기 위해 라즈베리파이 RC카를 활용하였으며, 주행 중 AI의 오인식 및 오분류를 유도하기 위한 적대적 공격을 적용하였습니다. RC카의 오인식 및 오분류 결과는 실시간으로 앱에 전송됩니다.\n\n사용자는 오인식 및 오분류가 자주 발생하는 지역을 확인할 수 있으며 커뮤니티를 통해 다른 사용자와 정보를 공유할 수 있습니다. 또한 주행 거리에 비례하여 금전적인 보상을 받을 수 있습니다. 기업은 사용자가 주행 중에 기록한 오인식 및 오분류 지역을 분석하여 해결책을 마련하고 시스템을 보완할수 있습니다. 또한 AI의 성능 향상을 앱을 통해 사용자에게 공지함으로써 지속적인 개선과 소통을 지원합니다.",
      "intention": "자율주행 환경에서 AI의 표지판 오인식으로 인한 피해는 누구의 책임인가?”\n최근 인공지능이 여러 분야에서 발전하면서 인공지능으로 인한 피해 또한 커지고 있습니다. 특히 자율주행 상황에서는 인공지능의 오인식 및 오분류가 치명적인 사고를 일으킬 수 있습니다. 자율주행 기술이 완벽하지 않아 운전자의 개입이 필요한 현재 상황에서, 이러한 사고가 운전자의 부주의 때문인지, 자율주행 자동차 제조사, 즉 기업의 책임인지 여부를 판단하는 것은 현재까지도 해결되지 않은 문제로 남아있습니다.\n\n이러한 배경 속에서 본 팀은 운전자와 기업의 입장을 조정하고 사고 상황을 빠르게 파악하기 위해 자율주행 표지판 오인식 확인 앱,“클락션”을 기획하였습니다. 클락션 앱은 기업과 운전자 모두가 AI의 표지판 오인식 및 오분류 상황을 빠르게 파악하고 대응할 수 있는 것을 목표로 합니다. 안전한 자율주행 환경을 만들기 위해 가장 먼저 필요한 것은 사고에 대한 기업의 빠른 상황 파악입니다. 빠른 상황 파악은 곧 기업의 빠른 대응으로 이어져, 보다 안전한 자율주행차 서비스를 제공할 수 있습니다. 이 서비스를 통해 기업은 AI 오인식 및 오분류 문제를 빠르게 파악할 수 있고, 운전자는 기업의 빠른 대응을 통해 기업에 대한 신뢰도를 높일 수 있습니다.",
      "tool": ["Android_Studio", "Figma", "Git", "VSCode", "Colab"],
      "language": ["Kotlin", "Python", "HTML", "CSS", "JavaScript", "JAVA"],
      "hardware": ["RaspberryPi", "RaspberryPI_Camera", "RC카"]
    },
    {
      "title": "Pumble",
      "description": "<Pumble>은 블록체인을 기반으로 한 공금 및 모임 관리 Dapp입니다. 주요 기능으로는 장부, 일정, 상점이 있습니다. 모임에 연결된 계좌에 새로운 거래가 발생하면, 즉시 블록체인 네트워크에 등록되어 구성원들이 공금 사용 내역을 실시간으로 모니터링할 수 있습니다. 또한, 모임 구성원들은 모임 일정에 참여하여 토큰을 획득하고 이를 통해 상점에서 상품을 구매할 수 있습니다. 이 밖에도 커뮤니티 기능을 구현하여 공금 관리, 행사 참여 증진, 구성원 간 소통이라는 세 가지 효과를 하나의 앱을 통해 얻을 수 있습니다.",
      "intention": "<Pumble>은 모임 운영의 고질적인 문제인 ‘공금 사용 내역의 불투명성’과 ‘모임 구성원의 행사 참여율 저조’에 대한 해결책을 제시하기 위해 기획되었습니다. 먼저, 암호화된 형태로 분산 저장되는 블록체인을 통해 공금 사용 내역의 신뢰성과 안전성을 보장하고자 하였습니다. 둘째로, 블록체인 네트워크 위에서 유통되는 토큰을 모임 내 재화로 활용하여 모임의 활성화를 촉진하고자 하였습니다. <Pumble>은 이를 통해 모임 운영의 모든 것을 하나의 어플로 관리하는 것을 목표로 합니다.",
      "tool": ["VSCode", "IntelliJ", "Github", "React_Native", "Node.js", "Ethereum_Sepolia", "MySQL", "Docker", "AWS", "Nginx", "Figma"],
      "language": ["JavaScript", "Solidity"]
    },
    {
      "title": "Purge",
      "description": "Purge.\n:제거[숙청]하다,\n(나쁜 생각·감정을) 몰아내다[없애다]\n\nEveryone has moments they’d like to erase.\n누구에게나 지우고 싶은 순간은 존재합니다.\n\n지우고 싶은 순간을 지울 수 있도록,\nLet’s Purge.\n\nPurge는 불법 촬영물로 인한 피해를 줄이기 위한 목적으로 개발되었습니다. 본인의 동의 없이 신체나 성행위 장면을 촬영하여 성인 사이트에 유포하는 ‘불법 촬영’ 범죄가 급증하고 있는 상황에서, 피해자는 자신의 영상이 인터넷에 게시되었는지를 확인하고 삭제 요청을 하기 위해 많은 시간과 노력을 들여야 합니다.\n\nPurge은 얼굴 인식 기술을 활용하여 성인 사이트에 게시된 불법 촬영물 중 피해자의 영상을 자동으로 탐지하고 증거를 수집합니다. 이를 통해 피해자가 직접 유해 사이트에 방문하지 않고도 자신의 영상을 확인하고 빠르게 대응할 수 있도록 지원합니다.",
      "intention": "Purge의 목표는 디지털 성범죄로 인해 고통받는 피해자들에게 실질적 도움을 제공하는 것입니다.\n\n불법 촬영물의 유포와 협박은 단순한 개인의 문제가 아닌 사회적 문제로 확대되고 있으며, 이에 대한 효과적인 대처 방안이 시급히 요구되고 있습니다. 전통적인 불법 촬영물 대응 방식은 피해자가 직접 유해 사이트를 방문해 증거를 수집해야 하는 번거로움이 있으며, 이 과정에서 2차 피해와 심리적 부담이 발생할 수 있습니다.\n\n이를 해결하기 위해 우리는 얼굴 인식 기술을 적용하여 피해자가 본인의 영상을 보다 신속하게 탐지할 수 있는 검색 엔진을 개발하였습니다. 피해자에게 불필요한 노출과 스트레스를 최소화할 수 있도록 설계되었으며, 피해자들이 빠르고 안전하게 문제를 해결하도록 돕습니다.",
      "tool": ["Vscode", "ChromaDB", "Colab", "Figma"],
      "language": ["Python", "HTML", "CSS", "JavaScript"]
    }
  ]
}